# set集合类型

'''
set集合是一个无序且元素是不重复的集合的数据类型
set集合的使用  大括号或set()的方法来定义
'''

vars = {1, 2, 3, 'a', 'b', 10}
print(vars, type(vars))  # {1, 2, 3, 'b', 10, 'a'} <class 'set'>
vars1 = set('123456')
print(vars1, type(vars1))  # {'2', '5', '4', '3', '6', '1'} <class 'set'>
# 如果需要定义一个空集合时，只能使用set()方法，因为大括号空是定义的空字典

a = {1, 2, 3, 'a'}
# 给集合添加元素
a.add('b')
print(a)
# 无法获取集合中的单个元素，但是可以添加和删除
# 删除元素
a.discard('a')
# 检查当前元素是否在集合中
print('a' in a)
print(1 in a)

# 集合主要用于运算，交集，差集，并集，对称集合
a={1,2,3,'a','b'}
b={1,'a',22,33}
# print(a & b) #交集 {1, 'a'}
# print(a-b)#差集{2, 3, 'b'}  a集合有b集合没有
# print(b-a)#{33, 22}
# print(a | b)#并集 {1, 2, 3, 'a', 33, 22, 'b'}
# print(a ^ b) #对称差集{33, 2, 3, 'b', 22} 把两个集合中重复的内容去掉在重合


