import time

class view1():
    def __init__(self):
        self.showindex()
        print('系统正在加载，请稍后。。。')
        time.sleep(0.5)
        self.showfunc()

    # 显示 欢迎界面
    def showindex(self):
        varstr='''
        *******************************************
        *                                         *
        *                                         *
        *             Wehcome To Bank             *
        *                                         *      
        *                                         *
        ******************************************* 
        '''
        print(varstr)

    # 显示 操作界面
    def showfunc(self):
        varstr='''
        ******************************************
        *    （1）注册           （2）查询          *
        *    （3）存款           （4）取款          *
        *    （5）转账           （6）改密          *
        *    （7）锁卡           （8）解卡          *    
        *    （9）补卡           （0）退出          *
        ******************************************           
        '''
        print(varstr)



# 显示 操作完后的选择界面
def viewbin():
    varstr = '''
    ******************************************
    *    （1）返回主菜单     （任意键）退出       *
    ******************************************           
    '''
    print(varstr)